
Процедура ЛогОтладка( Знач пТекст ) Экспорт
	
	Сообщить( "" + ТекущаяДата() + ". " + пТекст, СтатусСообщения.БезСтатуса );
	
КонецПроцедуры

Процедура ЛогИнформация( Знач пТекст ) Экспорт
	
	Сообщить( "" + ТекущаяДата() + ". " + пТекст, СтатусСообщения.Информация );
	
КонецПроцедуры

Функция ФайлСуществует( Знач пИмяФайла ) Экспорт

	Если Не ЗначениеЗаполнено( пИмяФайла ) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Файл = Новый Файл( пИмяФайла );
	
	Возврат Файл.Существует() И Файл.ЭтоФайл();

КонецФункции

Процедура ОбеспечитьТекстовыйФайл( Знач пИмяФайла ) Экспорт

	Если Не ЗначениеЗаполнено( пИмяФайла ) Тогда
		Возврат;
	КонецЕсли;

	Если Не ФайлСуществует( пИмяФайла ) Тогда
		записьФайла = Новый ЗаписьТекста( пИмяФайла );
		записьФайла.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбеспечитьКаталог(Знач Путь) Экспорт
	
	Объект = Новый Файл(Путь);
	Если Не Объект.Существует() Тогда
		СоздатьКаталог(Путь);
	ИначеЕсли НЕ Объект.ЭтоКаталог() Тогда
		ВызватьИсключение "Не удается создать каталог " + Путь + ". По данному пути уже существует файл.";
	КонецЕсли;
	
КонецПроцедуры
