
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	структПараметры = ПараметрыАПК( ПараметрКоманды );
	ПакетныйРежим.ЗапуститьВРежимеПредприятияПоСтрокеСоединения( структПараметры.Приложение1С, структПараметры.СтрокаСоединения, структПараметры.Пользователь, структПараметры.Пароль );
	#КонецЕсли
	
КонецПроцедуры

Функция ПараметрыАПК( Знач пПроверкаАПК )

	Возврат Справочники.ПроверкаАПК.Параметры( пПроверкаАПК );

КонецФункции // ПараметрыАПК()

