
Процедура Выгружается( Знач пХранилище ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Прочитать();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Истина;
	мз.Записать();

КонецПроцедуры

Процедура Выгружено( Знач пХранилище ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Ложь;
	мз.Записать();

КонецПроцедуры

Процедура ЗавершеноСОшибками( Знач пХранилище, Знач пТекстОшибки ) Экспорт

	мз = РегистрыСведений.СтатусыВыгрузки.СоздатьМенеджерЗаписи();
	мз.Хранилище = пХранилище;
	мз.Выгружается = Ложь;
	мз.ЕстьОшибкиВыгрузки = Истина;
	мз.ТекстОшибки = пТекстОшибки;
	мз.Записать();

КонецПроцедуры
